---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemCoating
source: html/77ea91bc-36f7-d3bd-5535-66540017a818.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemCoating Property

"Coating"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemCoating { get; }
```